pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/**
 * \file IfxMcdslight_reg.h
 * \brief
 * \copyright Copyright (c) 2020 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC33XED_UM_V1.4.0.R0
 * Specification: TC3xx User Manual.V1.4.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Mcdslight_Registers_Cfg Mcdslight address
 * \ingroup IfxSfr_Mcdslight_Registers
 * 
 * \defgroup IfxSfr_Mcdslight_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Mcdslight_Registers_Cfg
 *
 * \defgroup IfxSfr_Mcdslight_Registers_Cfg_Mcdslight 2-MCDSLIGHT
 * \ingroup IfxSfr_Mcdslight_Registers_Cfg
 *
 *
 */
#ifndef IFXMCDSLIGHT_REG_H
#define IFXMCDSLIGHT_REG_H 1
/******************************************************************************/
#include "IfxMcdslight_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mcdslight_Registers_Cfg_BaseAddress
 * \{  */

/** \brief MCDSLIGHT object */
#define MODULE_MCDSLIGHT /*lint --e(923, 9078)*/ ((*(Ifx_MCDSLIGHT*)0xFA010000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcdslight_Registers_Cfg_Mcdslight
 * \{  */
/** \brief 0, Clock Control Register */
#define MCDSLIGHT_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_CLC*)0xFA010000u)

/** \brief 4, OCDS Control and Status */
#define MCDSLIGHT_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_OCS*)0xFA010004u)

/** \brief 8, Module Identification Register */
#define MCDSLIGHT_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_ID*)0xFA010008u)

/** \brief 10, MCDS Control Register */
#define MCDSLIGHT_CT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_CT*)0xFA010010u)

/** \brief 14, MCDS Signal Source Control */
#define MCDSLIGHT_MUX /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MUX*)0xFA010014u)

/** \brief 18, Session ID Low Register */
#define MCDSLIGHT_SESSIDL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_SESSIDL*)0xFA010018u)

/** \brief 1C, Session ID High Register */
#define MCDSLIGHT_SESSIDH /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_SESSIDH*)0xFA01001Cu)

/** \brief 20, MCDS_TC Signal Source Control */
#define MCDSLIGHT_MUX_TC_RC /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MUX_TC_RC*)0xFA010020u)

/** \brief F8, Access Enable Register 1 */
#define MCDSLIGHT_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_ACCEN1*)0xFA0100F8u)

/** \brief FC, Access Enable Register 0 */
#define MCDSLIGHT_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_ACCEN0*)0xFA0100FCu)

/** \brief 200, Trace Buffer Write Pointer */
#define MCDSLIGHT_FIFONOW /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFONOW*)0xFA010200u)

/** \brief 204, Trace Buffer Bottom Register */
#define MCDSLIGHT_FIFOBOT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOBOT*)0xFA010204u)

/** \brief 208, Trace Buffer PRE/POST Register */
#define MCDSLIGHT_FIFOPRE /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOPRE*)0xFA010208u)

/** \brief 20C, Trace Buffer Top Register */
#define MCDSLIGHT_FIFOTOP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOTOP*)0xFA01020Cu)

/** \brief 210, Trace Buffer Control Register */
#define MCDSLIGHT_FIFOCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOCTL*)0xFA010210u)

/** \brief 214, Trace Buffer Comparator Register */
#define MCDSLIGHT_FIFOWARN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOWARN*)0xFA010214u)

/** \brief 218, Trace Buffer Comparator Register */
#define MCDSLIGHT_FIFOWARN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOWARN*)0xFA010218u)

/** \brief 21C, FIFO Overflow Counter Register */
#define MCDSLIGHT_FIFOOVRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFOOVRCNT*)0xFA01021Cu)

/** \brief 220, Trace Buffer Captured Write Pointer */
#define MCDSLIGHT_FIFONTNOW /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_FIFONTNOW*)0xFA010220u)

/** \brief 400, Clock Counter Register */
#define MCDSLIGHT_TSUREFCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TSUREFCNT*)0xFA010400u)

/** \brief 404, Clock Prescaler Register */
#define MCDSLIGHT_TSUPRSCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TSUPRSCL*)0xFA010404u)

/** \brief 408, Clock Counter Register */
#define MCDSLIGHT_TSUEMUCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TSUEMUCNT*)0xFA010408u)

/** \brief 800, Event Definition Register 0 */
#define MCDSLIGHT_MCXEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010800u)

/** \brief 804, Event Definition Register 1 */
#define MCDSLIGHT_MCXEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010804u)

/** \brief 808, Event Definition Register 2 */
#define MCDSLIGHT_MCXEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010808u)

/** \brief 80C, Event Definition Register 3 */
#define MCDSLIGHT_MCXEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01080Cu)

/** \brief 810, Event Definition Register 4 */
#define MCDSLIGHT_MCXEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010810u)

/** \brief 814, Event Definition Register 5 */
#define MCDSLIGHT_MCXEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010814u)

