pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 818, Event Definition Register 6 */
#define MCDSLIGHT_MCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010818u)

/** \brief 81C, Event Definition Register 7 */
#define MCDSLIGHT_MCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01081Cu)

/** \brief 820, Event Definition Register 8 */
#define MCDSLIGHT_MCXEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010820u)

/** \brief 824, Event Definition Register 9 */
#define MCDSLIGHT_MCXEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010824u)

/** \brief 828, Event Definition Register 10 */
#define MCDSLIGHT_MCXEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010828u)

/** \brief 82C, Event Definition Register 11 */
#define MCDSLIGHT_MCXEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01082Cu)

/** \brief 830, Event Definition Register 12 */
#define MCDSLIGHT_MCXEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010830u)

/** \brief 834, Event Definition Register 13 */
#define MCDSLIGHT_MCXEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010834u)

/** \brief 838, Event Definition Register 14 */
#define MCDSLIGHT_MCXEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010838u)

/** \brief 83C, Event Definition Register 15 */
#define MCDSLIGHT_MCXEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01083Cu)

/** \brief 840, Event Definition Register 16 */
#define MCDSLIGHT_MCXEVT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010840u)

/** \brief 844, Event Definition Register 17 */
#define MCDSLIGHT_MCXEVT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010844u)

/** \brief 848, Event Definition Register 18 */
#define MCDSLIGHT_MCXEVT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010848u)

/** \brief 84C, Event Definition Register 19 */
#define MCDSLIGHT_MCXEVT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01084Cu)

/** \brief 850, Event Definition Register 20 */
#define MCDSLIGHT_MCXEVT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010850u)

/** \brief 854, Event Definition Register 21 */
#define MCDSLIGHT_MCXEVT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010854u)

/** \brief 858, Event Definition Register 22 */
#define MCDSLIGHT_MCXEVT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA010858u)

/** \brief 85C, Event Definition Register 23 */
#define MCDSLIGHT_MCXEVT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXEVT*)0xFA01085Cu)

/** \brief 880, Action Definition Register 0 */
#define MCDSLIGHT_MCXACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010880u)

/** \brief 884, Action Definition Register 1 */
#define MCDSLIGHT_MCXACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010884u)

/** \brief 888, Action Definition Register 2 */
#define MCDSLIGHT_MCXACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010888u)

/** \brief 88C, Action Definition Register 3 */
#define MCDSLIGHT_MCXACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA01088Cu)

/** \brief 890, Action Definition Register 4 */
#define MCDSLIGHT_MCXACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010890u)

/** \brief 894, Action Definition Register 5 */
#define MCDSLIGHT_MCXACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010894u)

/** \brief 898, Action Definition Register 6 */
#define MCDSLIGHT_MCXACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010898u)

/** \brief 89C, Action Definition Register 7 */
#define MCDSLIGHT_MCXACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA01089Cu)

/** \brief 8A0, Action Definition Register 8 */
#define MCDSLIGHT_MCXACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108A0u)

/** \brief 8A4, Action Definition Register 9 */
#define MCDSLIGHT_MCXACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108A4u)

/** \brief 8A8, Action Definition Register 10 */
#define MCDSLIGHT_MCXACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108A8u)

/** \brief 8AC, Action Definition Register 11 */
#define MCDSLIGHT_MCXACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108ACu)

/** \brief 8B0, Action Definition Register 12 */
#define MCDSLIGHT_MCXACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108B0u)

/** \brief 8B4, Action Definition Register 13 */
#define MCDSLIGHT_MCXACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108B4u)

/** \brief 8B8, Action Definition Register 14 */
#define MCDSLIGHT_MCXACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108B8u)

/** \brief 8BC, Action Definition Register 15 */
#define MCDSLIGHT_MCXACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108BCu)

/** \brief 8C0, Action Definition Register 16 */
#define MCDSLIGHT_MCXACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108C0u)

/** \brief 8C4, Action Definition Register 17 */
#define MCDSLIGHT_MCXACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108C4u)

/** \brief 8C8, Action Definition Register 18 */
#define MCDSLIGHT_MCXACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108C8u)

/** \brief 8CC, Action Definition Register 19 */
#define MCDSLIGHT_MCXACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108CCu)

/** \brief 8D0, Action Definition Register 20 */
#define MCDSLIGHT_MCXACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108D0u)

/** \brief 8D4, Action Definition Register 21 */
#define MCDSLIGHT_MCXACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108D4u)

/** \brief 8D8, Action Definition Register 22 */
#define MCDSLIGHT_MCXACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108D8u)

/** \brief 8DC, Action Definition Register 23 */
#define MCDSLIGHT_MCXACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108DCu)

/** \brief 8E0, Action Definition Register 24 */
#define MCDSLIGHT_MCXACT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108E0u)

/** \brief 8E4, Action Definition Register 25 */
#define MCDSLIGHT_MCXACT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0108E4u)

