pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief AB4, Counter Limit Register */
#define MCDSLIGHT_MCX11_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AB4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX11_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX11_LMT.
*/
#define MCDSLIGHT_MCXLMT11 (MCDSLIGHT_MCX11_LMT)

/** \brief AB8, Current Count Register */
#define MCDSLIGHT_MCX11_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AB8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX11_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX11_CNT.
*/
#define MCDSLIGHT_MCXCNT11 (MCDSLIGHT_MCX11_CNT)

/** \brief AC0, Counter Control Register */
#define MCDSLIGHT_MCX12_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AC0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX12_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX12_CCL.
*/
#define MCDSLIGHT_MCXCCL12 (MCDSLIGHT_MCX12_CCL)

/** \brief AC4, Counter Limit Register */
#define MCDSLIGHT_MCX12_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AC4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX12_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX12_LMT.
*/
#define MCDSLIGHT_MCXLMT12 (MCDSLIGHT_MCX12_LMT)

/** \brief AC8, Current Count Register */
#define MCDSLIGHT_MCX12_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AC8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX12_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX12_CNT.
*/
#define MCDSLIGHT_MCXCNT12 (MCDSLIGHT_MCX12_CNT)

/** \brief AD0, Counter Control Register */
#define MCDSLIGHT_MCX13_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AD0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX13_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX13_CCL.
*/
#define MCDSLIGHT_MCXCCL13 (MCDSLIGHT_MCX13_CCL)

/** \brief AD4, Counter Limit Register */
#define MCDSLIGHT_MCX13_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AD4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX13_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX13_LMT.
*/
#define MCDSLIGHT_MCXLMT13 (MCDSLIGHT_MCX13_LMT)

/** \brief AD8, Current Count Register */
#define MCDSLIGHT_MCX13_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AD8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX13_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX13_CNT.
*/
#define MCDSLIGHT_MCXCNT13 (MCDSLIGHT_MCX13_CNT)

/** \brief AE0, Counter Control Register */
#define MCDSLIGHT_MCX14_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AE0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX14_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX14_CCL.
*/
#define MCDSLIGHT_MCXCCL14 (MCDSLIGHT_MCX14_CCL)

/** \brief AE4, Counter Limit Register */
#define MCDSLIGHT_MCX14_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AE4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX14_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX14_LMT.
*/
#define MCDSLIGHT_MCXLMT14 (MCDSLIGHT_MCX14_LMT)

/** \brief AE8, Current Count Register */
#define MCDSLIGHT_MCX14_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AE8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX14_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX14_CNT.
*/
#define MCDSLIGHT_MCXCNT14 (MCDSLIGHT_MCX14_CNT)

/** \brief AF0, Counter Control Register */
#define MCDSLIGHT_MCX15_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010AF0u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX15_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX15_CCL.
*/
#define MCDSLIGHT_MCXCCL15 (MCDSLIGHT_MCX15_CCL)

/** \brief AF4, Counter Limit Register */
#define MCDSLIGHT_MCX15_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010AF4u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX15_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX15_LMT.
*/
#define MCDSLIGHT_MCXLMT15 (MCDSLIGHT_MCX15_LMT)

/** \brief AF8, Current Count Register */
#define MCDSLIGHT_MCX15_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010AF8u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX15_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX15_CNT.
*/
#define MCDSLIGHT_MCXCNT15 (MCDSLIGHT_MCX15_CNT)

/** \brief 2000, Debug Status Register */
#define MCDSLIGHT_TCXDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXDCSTS*)0xFA012000u)

/** \brief 2008, Current Instruction Pointer */
#define MCDSLIGHT_TCXCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXCIP*)0xFA012008u)

/** \brief 200C, Compact Function Trace Register */
#define MCDSLIGHT_TCXCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXCFT*)0xFA01200Cu)

/** \brief 2200, Lookup Table Data Register */
#define MCDSLIGHT_TCXPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPALLUTD*)0xFA012200u)

/** \brief 2204, Lookup Table Address Register */
#define MCDSLIGHT_TCXPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPALLUTA*)0xFA012204u)

/** \brief 2210, Lookup Table Base Register */
#define MCDSLIGHT_TCXPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_BND*)0xFA012210u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL0_BND.
*/
#define MCDSLIGHT_TCXPALBND0 (MCDSLIGHT_TCXPAL0_BND)

/** \brief 2214, Lookup Table Range Register */
#define MCDSLIGHT_TCXPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_RNG*)0xFA012214u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL0_RNG.
*/
#define MCDSLIGHT_TCXPALRNG0 (MCDSLIGHT_TCXPAL0_RNG)

