pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 2218, Lookup Table Mapping Register */
#define MCDSLIGHT_TCXPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_MAP*)0xFA012218u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL0_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL0_MAP.
*/
#define MCDSLIGHT_TCXPALMAP0 (MCDSLIGHT_TCXPAL0_MAP)

/** \brief 2220, Lookup Table Base Register */
#define MCDSLIGHT_TCXPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_BND*)0xFA012220u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL1_BND.
*/
#define MCDSLIGHT_TCXPALBND1 (MCDSLIGHT_TCXPAL1_BND)

/** \brief 2224, Lookup Table Range Register */
#define MCDSLIGHT_TCXPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_RNG*)0xFA012224u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL1_RNG.
*/
#define MCDSLIGHT_TCXPALRNG1 (MCDSLIGHT_TCXPAL1_RNG)

/** \brief 2228, Lookup Table Mapping Register */
#define MCDSLIGHT_TCXPAL1_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_MAP*)0xFA012228u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL1_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL1_MAP.
*/
#define MCDSLIGHT_TCXPALMAP1 (MCDSLIGHT_TCXPAL1_MAP)

/** \brief 2230, Lookup Table Base Register */
#define MCDSLIGHT_TCXPAL2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_BND*)0xFA012230u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL2_BND.
*/
#define MCDSLIGHT_TCXPALBND2 (MCDSLIGHT_TCXPAL2_BND)

/** \brief 2234, Lookup Table Range Register */
#define MCDSLIGHT_TCXPAL2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_RNG*)0xFA012234u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL2_RNG.
*/
#define MCDSLIGHT_TCXPALRNG2 (MCDSLIGHT_TCXPAL2_RNG)

/** \brief 2238, Lookup Table Mapping Register */
#define MCDSLIGHT_TCXPAL2_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_MAP*)0xFA012238u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL2_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL2_MAP.
*/
#define MCDSLIGHT_TCXPALMAP2 (MCDSLIGHT_TCXPAL2_MAP)

/** \brief 2240, Lookup Table Base Register */
#define MCDSLIGHT_TCXPAL3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_BND*)0xFA012240u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL3_BND.
*/
#define MCDSLIGHT_TCXPALBND3 (MCDSLIGHT_TCXPAL3_BND)

/** \brief 2244, Lookup Table Range Register */
#define MCDSLIGHT_TCXPAL3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_RNG*)0xFA012244u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL3_RNG.
*/
#define MCDSLIGHT_TCXPALRNG3 (MCDSLIGHT_TCXPAL3_RNG)

/** \brief 2248, Lookup Table Mapping Register */
#define MCDSLIGHT_TCXPAL3_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXPAL_MAP*)0xFA012248u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXPAL3_MAP.
* To use register names with standard convension, please use MCDSLIGHT_TCXPAL3_MAP.
*/
#define MCDSLIGHT_TCXPALMAP3 (MCDSLIGHT_TCXPAL3_MAP)

/** \brief 2400, Comparator Bound Register 0 */
#define MCDSLIGHT_TCXEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012400u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA0_BND.
*/
#define MCDSLIGHT_TCXEABND0 (MCDSLIGHT_TCXEA0_BND)

/** \brief 2404, Comparator Range Register 0 */
#define MCDSLIGHT_TCXEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012404u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA0_RNG.
*/
#define MCDSLIGHT_TCXEARNG0 (MCDSLIGHT_TCXEA0_RNG)

/** \brief 2410, Comparator Bound Register 1 */
#define MCDSLIGHT_TCXEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012410u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA1_BND.
*/
#define MCDSLIGHT_TCXEABND1 (MCDSLIGHT_TCXEA1_BND)

/** \brief 2414, Comparator Range Register 1 */
#define MCDSLIGHT_TCXEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012414u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA1_RNG.
*/
#define MCDSLIGHT_TCXEARNG1 (MCDSLIGHT_TCXEA1_RNG)

/** \brief 2420, Comparator Bound Register 2 */
#define MCDSLIGHT_TCXEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012420u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA2_BND.
*/
#define MCDSLIGHT_TCXEABND2 (MCDSLIGHT_TCXEA2_BND)

/** \brief 2424, Comparator Range Register 2 */
#define MCDSLIGHT_TCXEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012424u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA2_RNG.
*/
#define MCDSLIGHT_TCXEARNG2 (MCDSLIGHT_TCXEA2_RNG)

/** \brief 2430, Comparator Bound Register 3 */
#define MCDSLIGHT_TCXEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_BND*)0xFA012430u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA3_BND.
*/
#define MCDSLIGHT_TCXEABND3 (MCDSLIGHT_TCXEA3_BND)

/** \brief 2434, Comparator Range Register 3 */
#define MCDSLIGHT_TCXEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEA_RNG*)0xFA012434u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXEA3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXEA3_RNG.
*/
#define MCDSLIGHT_TCXEARNG3 (MCDSLIGHT_TCXEA3_RNG)

