pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 2510, Comparator Bound Register 1 */
#define MCDSLIGHT_TCXAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_BND*)0xFA012510u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC1_BND.
*/
#define MCDSLIGHT_TCXACBND1 (MCDSLIGHT_TCXAC1_BND)

/** \brief 2514, Comparator Range Register 1 */
#define MCDSLIGHT_TCXAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_RNG*)0xFA012514u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC1_RNG.
*/
#define MCDSLIGHT_TCXACRNG1 (MCDSLIGHT_TCXAC1_RNG)

/** \brief 2518, Comparator Mask Register 1 */
#define MCDSLIGHT_TCXAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_MSK*)0xFA012518u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC1_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC1_MSK.
*/
#define MCDSLIGHT_TCXACMSK1 (MCDSLIGHT_TCXAC1_MSK)

/** \brief 2520, Comparator Bound Register 2 */
#define MCDSLIGHT_TCXAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_BND*)0xFA012520u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC2_BND.
*/
#define MCDSLIGHT_TCXACBND2 (MCDSLIGHT_TCXAC2_BND)

/** \brief 2524, Comparator Range Register 2 */
#define MCDSLIGHT_TCXAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_RNG*)0xFA012524u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC2_RNG.
*/
#define MCDSLIGHT_TCXACRNG2 (MCDSLIGHT_TCXAC2_RNG)

/** \brief 2528, Comparator Mask Register 2 */
#define MCDSLIGHT_TCXAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_MSK*)0xFA012528u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC2_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC2_MSK.
*/
#define MCDSLIGHT_TCXACMSK2 (MCDSLIGHT_TCXAC2_MSK)

/** \brief 2530, Comparator Bound Register 3 */
#define MCDSLIGHT_TCXAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_BND*)0xFA012530u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC3_BND.
*/
#define MCDSLIGHT_TCXACBND3 (MCDSLIGHT_TCXAC3_BND)

/** \brief 2534, Comparator Range Register 3 */
#define MCDSLIGHT_TCXAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_RNG*)0xFA012534u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC3_RNG.
*/
#define MCDSLIGHT_TCXACRNG3 (MCDSLIGHT_TCXAC3_RNG)

/** \brief 2538, Comparator Mask Register 3 */
#define MCDSLIGHT_TCXAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXAC_MSK*)0xFA012538u)
/** Alias (User Manual Name) for MCDSLIGHT_TCXAC3_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCXAC3_MSK.
*/
#define MCDSLIGHT_TCXACMSK3 (MCDSLIGHT_TCXAC3_MSK)

/** \brief 2580, DTU FIFOs Fill Level */
#define MCDSLIGHT_TCXDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXDTUFLV*)0xFA012580u)

/** \brief 2800, Event Definition Register 0 */
#define MCDSLIGHT_TCXEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012800u)

/** \brief 2804, Event Definition Register 1 */
#define MCDSLIGHT_TCXEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012804u)

/** \brief 2808, Event Definition Register 2 */
#define MCDSLIGHT_TCXEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012808u)

/** \brief 280C, Event Definition Register 3 */
#define MCDSLIGHT_TCXEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA01280Cu)

/** \brief 2810, Event Definition Register 4 */
#define MCDSLIGHT_TCXEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012810u)

/** \brief 2814, Event Definition Register 5 */
#define MCDSLIGHT_TCXEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012814u)

/** \brief 2818, Event Definition Register 6 */
#define MCDSLIGHT_TCXEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012818u)

/** \brief 281C, Event Definition Register 7 */
#define MCDSLIGHT_TCXEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA01281Cu)

/** \brief 2820, Event Definition Register 8 */
#define MCDSLIGHT_TCXEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012820u)

/** \brief 2824, Event Definition Register 9 */
#define MCDSLIGHT_TCXEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012824u)

/** \brief 2828, Event Definition Register 10 */
#define MCDSLIGHT_TCXEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012828u)

/** \brief 282C, Event Definition Register 11 */
#define MCDSLIGHT_TCXEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA01282Cu)

/** \brief 2830, Event Definition Register 12 */
#define MCDSLIGHT_TCXEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012830u)

/** \brief 2834, Event Definition Register 13 */
#define MCDSLIGHT_TCXEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012834u)

/** \brief 2838, Event Definition Register 14 */
#define MCDSLIGHT_TCXEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA012838u)

/** \brief 283C, Event Definition Register 15 */
#define MCDSLIGHT_TCXEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXEVT*)0xFA01283Cu)

/** \brief 2880, Action Definition Register 0 */
#define MCDSLIGHT_TCXACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012880u)

/** \brief 2884, Action Definition Register 1 */
#define MCDSLIGHT_TCXACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012884u)

/** \brief 2888, Action Definition Register 2 */
#define MCDSLIGHT_TCXACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012888u)

/** \brief 288C, Action Definition Register 3 */
#define MCDSLIGHT_TCXACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA01288Cu)

/** \brief 2890, Action Definition Register 4 */
#define MCDSLIGHT_TCXACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012890u)

/** \brief 2894, Action Definition Register 5 */
#define MCDSLIGHT_TCXACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012894u)

/** \brief 2898, Action Definition Register 6 */
#define MCDSLIGHT_TCXACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA012898u)

/** \brief 289C, Action Definition Register 7 */
#define MCDSLIGHT_TCXACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA01289Cu)

/** \brief 28A0, Action Definition Register 8 */
#define MCDSLIGHT_TCXACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128A0u)

/** \brief 28A4, Action Definition Register 9 */
#define MCDSLIGHT_TCXACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128A4u)

/** \brief 28A8, Action Definition Register 10 */
#define MCDSLIGHT_TCXACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128A8u)

/** \brief 28AC, Action Definition Register 11 */
#define MCDSLIGHT_TCXACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128ACu)

/** \brief 28B0, Action Definition Register 12 */
#define MCDSLIGHT_TCXACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCXACT*)0xFA0128B0u)

