pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 4440, Comparator Bound Register 4 */
#define MCDSLIGHT_TCYEA4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014440u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA4_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA4_BND.
*/
#define MCDSLIGHT_TCYEABND4 (MCDSLIGHT_TCYEA4_BND)

/** \brief 4444, Comparator Range Register 4 */
#define MCDSLIGHT_TCYEA4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014444u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA4_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA4_RNG.
*/
#define MCDSLIGHT_TCYEARNG4 (MCDSLIGHT_TCYEA4_RNG)

/** \brief 4450, Comparator Bound Register 5 */
#define MCDSLIGHT_TCYEA5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014450u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA5_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA5_BND.
*/
#define MCDSLIGHT_TCYEABND5 (MCDSLIGHT_TCYEA5_BND)

/** \brief 4454, Comparator Range Register 5 */
#define MCDSLIGHT_TCYEA5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014454u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA5_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA5_RNG.
*/
#define MCDSLIGHT_TCYEARNG5 (MCDSLIGHT_TCYEA5_RNG)

/** \brief 4460, Comparator Bound Register 6 */
#define MCDSLIGHT_TCYEA6_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014460u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA6_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA6_BND.
*/
#define MCDSLIGHT_TCYEABND6 (MCDSLIGHT_TCYEA6_BND)

/** \brief 4464, Comparator Range Register 6 */
#define MCDSLIGHT_TCYEA6_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014464u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA6_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA6_RNG.
*/
#define MCDSLIGHT_TCYEARNG6 (MCDSLIGHT_TCYEA6_RNG)

/** \brief 4470, Comparator Bound Register 7 */
#define MCDSLIGHT_TCYEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_BND*)0xFA014470u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA7_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA7_BND.
*/
#define MCDSLIGHT_TCYEABND7 (MCDSLIGHT_TCYEA7_BND)

/** \brief 4474, Comparator Range Register 7 */
#define MCDSLIGHT_TCYEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEA_RNG*)0xFA014474u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYEA7_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYEA7_RNG.
*/
#define MCDSLIGHT_TCYEARNG7 (MCDSLIGHT_TCYEA7_RNG)

/** \brief 4480, Comparator Bound Register 0 */
#define MCDSLIGHT_TCYWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_BND*)0xFA014480u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_BND.
*/
#define MCDSLIGHT_TCYWDBND0 (MCDSLIGHT_TCYWD0_BND)

/** \brief 4484, Comparator Bound Register 0 */
#define MCDSLIGHT_TCYWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HBND*)0xFA014484u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_HBND.
*/
#define MCDSLIGHT_TCYWDHBND0 (MCDSLIGHT_TCYWD0_HBND)

/** \brief 4488, Comparator Range Register 0 */
#define MCDSLIGHT_TCYWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_RNG*)0xFA014488u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_RNG.
*/
#define MCDSLIGHT_TCYWDRNG0 (MCDSLIGHT_TCYWD0_RNG)

/** \brief 448C, Comparator Range Register 0 */
#define MCDSLIGHT_TCYWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HRNG*)0xFA01448Cu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_HRNG.
*/
#define MCDSLIGHT_TCYWDHRNG0 (MCDSLIGHT_TCYWD0_HRNG)

/** \brief 4490, Comparator Mask Register 0 */
#define MCDSLIGHT_TCYWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_MSK*)0xFA014490u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_MSK.
*/
#define MCDSLIGHT_TCYWDMSK0 (MCDSLIGHT_TCYWD0_MSK)

/** \brief 4494, Comparator Mask Register 0 */
#define MCDSLIGHT_TCYWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HMSK*)0xFA014494u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_HMSK.
*/
#define MCDSLIGHT_TCYWDHMSK0 (MCDSLIGHT_TCYWD0_HMSK)

/** \brief 449C, Comparator Sign Register 0 */
#define MCDSLIGHT_TCYWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_SGN*)0xFA01449Cu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD0_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD0_SGN.
*/
#define MCDSLIGHT_TCYWDSGN0 (MCDSLIGHT_TCYWD0_SGN)

/** \brief 44A0, Comparator Bound Register 1 */
#define MCDSLIGHT_TCYWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_BND*)0xFA0144A0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_BND.
*/
#define MCDSLIGHT_TCYWDBND1 (MCDSLIGHT_TCYWD1_BND)

/** \brief 44A4, Comparator Bound Register 1 */
#define MCDSLIGHT_TCYWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HBND*)0xFA0144A4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_HBND.
*/
#define MCDSLIGHT_TCYWDHBND1 (MCDSLIGHT_TCYWD1_HBND)

/** \brief 44A8, Comparator Range Register 1 */
#define MCDSLIGHT_TCYWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_RNG*)0xFA0144A8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_RNG.
*/
#define MCDSLIGHT_TCYWDRNG1 (MCDSLIGHT_TCYWD1_RNG)

/** \brief 44AC, Comparator Range Register 1 */
#define MCDSLIGHT_TCYWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HRNG*)0xFA0144ACu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_HRNG.
*/
#define MCDSLIGHT_TCYWDHRNG1 (MCDSLIGHT_TCYWD1_HRNG)

/** \brief 44B0, Comparator Mask Register 1 */
#define MCDSLIGHT_TCYWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_MSK*)0xFA0144B0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_MSK.
*/
#define MCDSLIGHT_TCYWDMSK1 (MCDSLIGHT_TCYWD1_MSK)

/** \brief 44B4, Comparator Mask Register 1 */
#define MCDSLIGHT_TCYWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HMSK*)0xFA0144B4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_HMSK.
*/
#define MCDSLIGHT_TCYWDHMSK1 (MCDSLIGHT_TCYWD1_HMSK)

