pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 44BC, Comparator Sign Register 1 */
#define MCDSLIGHT_TCYWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_SGN*)0xFA0144BCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD1_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD1_SGN.
*/
#define MCDSLIGHT_TCYWDSGN1 (MCDSLIGHT_TCYWD1_SGN)

/** \brief 44C0, Comparator Bound Register 2 */
#define MCDSLIGHT_TCYWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_BND*)0xFA0144C0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_BND.
*/
#define MCDSLIGHT_TCYWDBND2 (MCDSLIGHT_TCYWD2_BND)

/** \brief 44C4, Comparator Bound Register 2 */
#define MCDSLIGHT_TCYWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HBND*)0xFA0144C4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_HBND.
*/
#define MCDSLIGHT_TCYWDHBND2 (MCDSLIGHT_TCYWD2_HBND)

/** \brief 44C8, Comparator Range Register 2 */
#define MCDSLIGHT_TCYWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_RNG*)0xFA0144C8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_RNG.
*/
#define MCDSLIGHT_TCYWDRNG2 (MCDSLIGHT_TCYWD2_RNG)

/** \brief 44CC, Comparator Range Register 2 */
#define MCDSLIGHT_TCYWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HRNG*)0xFA0144CCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_HRNG.
*/
#define MCDSLIGHT_TCYWDHRNG2 (MCDSLIGHT_TCYWD2_HRNG)

/** \brief 44D0, Comparator Mask Register 2 */
#define MCDSLIGHT_TCYWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_MSK*)0xFA0144D0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_MSK.
*/
#define MCDSLIGHT_TCYWDMSK2 (MCDSLIGHT_TCYWD2_MSK)

/** \brief 44D4, Comparator Mask Register 2 */
#define MCDSLIGHT_TCYWD2_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HMSK*)0xFA0144D4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_HMSK.
*/
#define MCDSLIGHT_TCYWDHMSK2 (MCDSLIGHT_TCYWD2_HMSK)

/** \brief 44DC, Comparator Sign Register 2 */
#define MCDSLIGHT_TCYWD2_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_SGN*)0xFA0144DCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD2_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD2_SGN.
*/
#define MCDSLIGHT_TCYWDSGN2 (MCDSLIGHT_TCYWD2_SGN)

/** \brief 44E0, Comparator Bound Register 3 */
#define MCDSLIGHT_TCYWD3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_BND*)0xFA0144E0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_BND.
*/
#define MCDSLIGHT_TCYWDBND3 (MCDSLIGHT_TCYWD3_BND)

/** \brief 44E4, Comparator Bound Register 3 */
#define MCDSLIGHT_TCYWD3_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HBND*)0xFA0144E4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_HBND.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_HBND.
*/
#define MCDSLIGHT_TCYWDHBND3 (MCDSLIGHT_TCYWD3_HBND)

/** \brief 44E8, Comparator Range Register 3 */
#define MCDSLIGHT_TCYWD3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_RNG*)0xFA0144E8u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_RNG.
*/
#define MCDSLIGHT_TCYWDRNG3 (MCDSLIGHT_TCYWD3_RNG)

/** \brief 44EC, Comparator Range Register 3 */
#define MCDSLIGHT_TCYWD3_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HRNG*)0xFA0144ECu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_HRNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_HRNG.
*/
#define MCDSLIGHT_TCYWDHRNG3 (MCDSLIGHT_TCYWD3_HRNG)

/** \brief 44F0, Comparator Mask Register 3 */
#define MCDSLIGHT_TCYWD3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_MSK*)0xFA0144F0u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_MSK.
*/
#define MCDSLIGHT_TCYWDMSK3 (MCDSLIGHT_TCYWD3_MSK)

/** \brief 44F4, Comparator Mask Register 3 */
#define MCDSLIGHT_TCYWD3_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_HMSK*)0xFA0144F4u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_HMSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_HMSK.
*/
#define MCDSLIGHT_TCYWDHMSK3 (MCDSLIGHT_TCYWD3_HMSK)

/** \brief 44FC, Comparator Sign Register 3 */
#define MCDSLIGHT_TCYWD3_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYWD_SGN*)0xFA0144FCu)
/** Alias (User Manual Name) for MCDSLIGHT_TCYWD3_SGN.
* To use register names with standard convension, please use MCDSLIGHT_TCYWD3_SGN.
*/
#define MCDSLIGHT_TCYWDSGN3 (MCDSLIGHT_TCYWD3_SGN)

/** \brief 4500, Comparator Bound Register 0 */
#define MCDSLIGHT_TCYAC0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_BND*)0xFA014500u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC0_BND.
*/
#define MCDSLIGHT_TCYACBND0 (MCDSLIGHT_TCYAC0_BND)

/** \brief 4504, Comparator Range Register 0 */
#define MCDSLIGHT_TCYAC0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_RNG*)0xFA014504u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC0_RNG.
*/
#define MCDSLIGHT_TCYACRNG0 (MCDSLIGHT_TCYAC0_RNG)

/** \brief 4508, Comparator Mask Register 0 */
#define MCDSLIGHT_TCYAC0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_MSK*)0xFA014508u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC0_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC0_MSK.
*/
#define MCDSLIGHT_TCYACMSK0 (MCDSLIGHT_TCYAC0_MSK)

