pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxMcdslight_reg.h
/** \brief 48AC, Action Definition Register 11 */
#define MCDSLIGHT_TCYACT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148ACu)

/** \brief 48B0, Action Definition Register 12 */
#define MCDSLIGHT_TCYACT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148B0u)

/** \brief 48B4, Action Definition Register 13 */
#define MCDSLIGHT_TCYACT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148B4u)

/** \brief 48B8, Action Definition Register 14 */
#define MCDSLIGHT_TCYACT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148B8u)

/** \brief 48BC, Action Definition Register 15 */
#define MCDSLIGHT_TCYACT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148BCu)

/** \brief 48C0, Action Definition Register 16 */
#define MCDSLIGHT_TCYACT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148C0u)

/** \brief 48C4, Action Definition Register 17 */
#define MCDSLIGHT_TCYACT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148C4u)

/** \brief 48C8, Action Definition Register 18 */
#define MCDSLIGHT_TCYACT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148C8u)

/** \brief 48CC, Action Definition Register 19 */
#define MCDSLIGHT_TCYACT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148CCu)

/** \brief 48D0, Action Definition Register 20 */
#define MCDSLIGHT_TCYACT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148D0u)

/** \brief 48D4, Action Definition Register 21 */
#define MCDSLIGHT_TCYACT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148D4u)

/** \brief 48D8, Action Definition Register 22 */
#define MCDSLIGHT_TCYACT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148D8u)

/** \brief 48DC, Action Definition Register 23 */
#define MCDSLIGHT_TCYACT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148DCu)

/** \brief 5000, Comparator Bound Register 0 */
#define MCDSLIGHT_TCYIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015000u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP0_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP0_BND.
*/
#define MCDSLIGHT_TCYIPBND0 (MCDSLIGHT_TCYIP0_BND)

/** \brief 5004, Comparator Range Register 0 */
#define MCDSLIGHT_TCYIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015004u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP0_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP0_RNG.
*/
#define MCDSLIGHT_TCYIPRNG0 (MCDSLIGHT_TCYIP0_RNG)

/** \brief 5010, Comparator Bound Register 1 */
#define MCDSLIGHT_TCYIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015010u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP1_BND.
*/
#define MCDSLIGHT_TCYIPBND1 (MCDSLIGHT_TCYIP1_BND)

/** \brief 5014, Comparator Range Register 1 */
#define MCDSLIGHT_TCYIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015014u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP1_RNG.
*/
#define MCDSLIGHT_TCYIPRNG1 (MCDSLIGHT_TCYIP1_RNG)

/** \brief 5020, Comparator Bound Register 2 */
#define MCDSLIGHT_TCYIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015020u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP2_BND.
*/
#define MCDSLIGHT_TCYIPBND2 (MCDSLIGHT_TCYIP2_BND)

/** \brief 5024, Comparator Range Register 2 */
#define MCDSLIGHT_TCYIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015024u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP2_RNG.
*/
#define MCDSLIGHT_TCYIPRNG2 (MCDSLIGHT_TCYIP2_RNG)

/** \brief 5030, Comparator Bound Register 3 */
#define MCDSLIGHT_TCYIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015030u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP3_BND.
*/
#define MCDSLIGHT_TCYIPBND3 (MCDSLIGHT_TCYIP3_BND)

/** \brief 5034, Comparator Range Register 3 */
#define MCDSLIGHT_TCYIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015034u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP3_RNG.
*/
#define MCDSLIGHT_TCYIPRNG3 (MCDSLIGHT_TCYIP3_RNG)

/** \brief 5040, Comparator Bound Register 4 */
#define MCDSLIGHT_TCYIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015040u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP4_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP4_BND.
*/
#define MCDSLIGHT_TCYIPBND4 (MCDSLIGHT_TCYIP4_BND)

/** \brief 5044, Comparator Range Register 4 */
#define MCDSLIGHT_TCYIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015044u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP4_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP4_RNG.
*/
#define MCDSLIGHT_TCYIPRNG4 (MCDSLIGHT_TCYIP4_RNG)

/** \brief 5050, Comparator Bound Register 5 */
#define MCDSLIGHT_TCYIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_BND*)0xFA015050u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP5_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP5_BND.
*/
#define MCDSLIGHT_TCYIPBND5 (MCDSLIGHT_TCYIP5_BND)

/** \brief 5054, Comparator Range Register 5 */
#define MCDSLIGHT_TCYIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYIP_RNG*)0xFA015054u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYIP5_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYIP5_RNG.
*/
#define MCDSLIGHT_TCYIPRNG5 (MCDSLIGHT_TCYIP5_RNG)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDSLIGHT_REG_H */
